# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция вызывается следующим образом: for el in fact(n).
# Она отвечает за получение факториала числа. В цикле нужно выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.



from functools import reduce

n = int(input())
def my_func(n):
    yield reduce(lambda a, b: a*b, list(i for i in range(1, n+1)))


for i in range(1, n+1):
    print(list(my_func(i)))









